titulo

In [2]:
import pandas as pd

In [6]:
dataframe = pd.DataFrame({ 
    'column_1': [12,10,5], 
    'column_2': [6,7,8], 
    'column_3': [1,3,4]
})

In [7]:
dataframe

   column_1  column_2  column_3
0        12         6         1
1        10         7         3
2         5         8         4

In [20]:
df = pd.read_csv('./base_produto.csv')

In [21]:
df

   Id                    NOME   preço  Id_categoria
0   1                    Bola    35.0           1.0
1   2                Patinete   120.0           1.0
2   3                Carrinho     NaN           1.0
3   4                   Skate   296.0           1.0
4   5                     NaN  3500.0           2.0
5   6           Monitor LG 19   450.0           2.0
6   7  O Diário de Anne Frank    45.0           NaN
7   8        O dia do Curinga    65.0           3.0
8   9        O mundo de Sofia     NaN           3.0
9  10      Através do Espelho    38.0           3.0

In [10]:
df.dtypes

Id                int64
NOME             object
preço           float64
Id_categoria    float64
dtype: object

In [16]:
df.head(5)

   Id      NOME   preço  Id_categoria
0   1      Bola    35.0           1.0
1   2  Patinete   120.0           1.0
2   3  Carrinho     NaN           1.0
3   4     Skate   296.0           1.0
4   5       NaN  3500.0           2.0

In [18]:
df.tail()

   Id                    NOME  preço  Id_categoria
5   6           Monitor LG 19  450.0           2.0
6   7  O Diário de Anne Frank   45.0           NaN
7   8        O dia do Curinga   65.0           3.0
8   9        O mundo de Sofia    NaN           3.0
9  10      Através do Espelho   38.0           3.0

In [19]:
df.describe()

             Id        preço  Id_categoria
count  10.00000     8.000000      9.000000
mean    5.50000   568.625000      1.888889
std     3.02765  1193.838938      0.927961
min     1.00000    35.000000      1.000000
25%     3.25000    43.250000      1.000000
50%     5.50000    92.500000      2.000000
75%     7.75000   334.500000      3.000000
max    10.00000  3500.000000      3.000000

In [23]:
df.shape

(10, 4)

In [24]:
df.columns

Index(['Id', 'NOME', 'preço', 'Id_categoria'], dtype='object')

In [25]:
df.count

<bound method DataFrame.count of    Id                    NOME   preço  Id_categoria
0   1                    Bola    35.0           1.0
1   2                Patinete   120.0           1.0
2   3                Carrinho     NaN           1.0
3   4                   Skate   296.0           1.0
4   5                     NaN  3500.0           2.0
5   6           Monitor LG 19   450.0           2.0
6   7  O Diário de Anne Frank    45.0           NaN
7   8        O dia do Curinga    65.0           3.0
8   9        O mundo de Sofia     NaN           3.0
9  10      Através do Espelho    38.0           3.0>

In [26]:
df.count()

Id              10
NOME             9
preço            8
Id_categoria     9
dtype: int64

In [31]:
df.value_counts('Id_categoria')

Id_categoria
1.0    4
3.0    3
2.0    2
Name: count, dtype: int64

In [34]:
df['Id_categoria'].unique()

array([ 1.,  2., nan,  3.])

In [35]:
df.isna().sum()

Id              0
NOME            1
preço           2
Id_categoria    1
dtype: int64

In [42]:
x = df[['NOME','Id_categoria']]
x

                     NOME  Id_categoria
0                    Bola           1.0
1                Patinete           1.0
2                Carrinho           1.0
3                   Skate           1.0
4                     NaN           2.0
5           Monitor LG 19           2.0
6  O Diário de Anne Frank           NaN
7        O dia do Curinga           3.0
8        O mundo de Sofia           3.0
9      Através do Espelho           3.0

In [49]:
names = x.drop('Id_categoria', axis=1)
names

                     NOME
0                    Bola
1                Patinete
2                Carrinho
3                   Skate
4                     NaN
5           Monitor LG 19
6  O Diário de Anne Frank
7        O dia do Curinga
8        O mundo de Sofia
9      Através do Espelho

In [3]:
rename = df.rename({
    'Id': id,
    'NOME': 'nome',
    'preço': 'preco',
    'Id_categoria': 'id_categoria'
})

NameError: name 'df' is not defined

In [55]:
rename

   Id                    NOME   preço  Id_categoria
0   1                    Bola    35.0           1.0
1   2                Patinete   120.0           1.0
2   3                Carrinho     NaN           1.0
3   4                   Skate   296.0           1.0
4   5                     NaN  3500.0           2.0
5   6           Monitor LG 19   450.0           2.0
6   7  O Diário de Anne Frank    45.0           NaN
7   8        O dia do Curinga    65.0           3.0
8   9        O mundo de Sofia     NaN           3.0
9  10      Através do Espelho    38.0           3.0

In [1]:
print('Ola')

Ola

In [4]:
pip install folium

Collecting folium
  Downloading folium-0.15.0-py2.py3-none-any.whl.metadata (3.4 kB)
Collecting branca>=0.6.0 (from folium)
  Downloading branca-0.7.0-py3-none-any.whl.metadata (1.5 kB)
Requirement already satisfied: jinja2>=2.9 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from folium) (3.1.2)
Collecting numpy (from folium)
  Downloading numpy-1.26.2-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (61 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 61.2/61.2 kB 342.7 kB/s eta 0:00:00 kB/s eta 0:00:01:01
Requirement already satisfied: requests in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from folium) (2.31.0)
Requirement already satisfied: MarkupSafe>=2.0 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from jinja2>=2.9->folium) (2.1.1)
Requirement already satisfied: charset-normalizer<4,>=2 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from requests->folium) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from requests->folium) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from requests->folium) (1.26.18)
Requirement already satisfied: certifi>=2017.4.17 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from requests->folium) (2023.11.17)
Downloading folium-0.15.0-py2.py3-none-any.whl (100 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 100.3/100.3 kB 937.0 kB/s eta 0:00:001m987.2 kB/s eta 0:00:01
Downloading branca-0.7.0-py3-none-any.whl (25 kB)
Downloading numpy-1.26.2-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (18.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 18.2/18.2 MB 351.1 kB/s eta 0:00:00m eta 0:00:01[36m0:00:02
Installing collected packages: numpy, branca, folium
Successfully installed branca-0.7.0 folium-0.15.0 numpy-1.26.2
Note: you may need to restart the kernel to use updated packages.

In [1]:
pip install pandas

Collecting pandas
  Using cached pandas-2.1.3-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (18 kB)
Requirement already satisfied: numpy<2,>=1.23.2 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Collecting tzdata>=2022.1 (from pandas)
  Using cached tzdata-2023.3-py2.py3-none-any.whl (341 kB)
Requirement already satisfied: six>=1.5 in /home/hnrqss/anaconda3/envs/venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.1.3-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.2/12.2 MB 616.2 kB/s eta 0:00:00m eta 0:00:010:01:02
Installing collected packages: tzdata, pandas
Successfully installed pandas-2.1.3 tzdata-2023.3
Note: you may need to restart the kernel to use updated packages.

In [27]:
import pandas as pd

df = pd.read_csv('./base_produto.csv')

df_editado = df.rename(columns={
    'Id': 'id',
    'NOME': 'nome',
    'preço': 'preco',
    'Id_categoria': 'id_categoria'
})

df_editado

   id                    nome   preco  id_categoria
0   1                    Bola    35.0           1.0
1   2                Patinete   120.0           1.0
2   3                Carrinho     NaN           1.0
3   4                   Skate   296.0           1.0
4   5                     NaN  3500.0           2.0
5   6           Monitor LG 19   450.0           2.0
6   7  O Diário de Anne Frank    45.0           NaN
7   8        O dia do Curinga    65.0           3.0
8   9        O mundo de Sofia     NaN           3.0
9  10      Através do Espelho    38.0           3.0

In [29]:
df_editado = df_editado.drop(labels='id', axis=1)

df_editado = df_editado.drop(0)

df_editado

                     nome   preco  id_categoria
1                Patinete   120.0           1.0
2                Carrinho     NaN           1.0
3                   Skate   296.0           1.0
4                     NaN  3500.0           2.0
5           Monitor LG 19   450.0           2.0
6  O Diário de Anne Frank    45.0           NaN
7        O dia do Curinga    65.0           3.0
8        O mundo de Sofia     NaN           3.0
9      Através do Espelho    38.0           3.0

In [32]:
loc = df_editado.loc(axis='preco')

loc

ValueError: No axis named preco for object type DataFrame